{
  "project_name": "Organism 3D Visualization Refinement v2",
  "status": "draft",
  "purpose": "Refine the Organism 3D view so domains cluster with clear palettes, ghost vs live trading states stay legible, USD-weighted particles convey value through fiery motion, and bus-scheduling timelines play back captured snapshots inside a polished brain-like UI.",
  "current_state_summary": [
    "Domain clustering and palette assignment are inconsistent; inter-domain links lack distinct styling.",
    "USD valuation is not bound to particle density/size or trail intensity; motion feels generic.",
    "Ghost and live trading states share overlapping visuals, creating ambiguity in execution status.",
    "Bus-scheduling ghost/live states are not auto-snapshotted or replayable on a timeline.",
    "Layout and UX lack the intended brain-like structure, responsive controls, and verification artifacts."
  ],
  "objectives": [
    "Cluster nodes by domain with shared colors and clear legends; style inter-domain links with distinct accents and filters.",
    "Bind USD value to particle density, size, emission rate, and fiery trail intensity with bounce/elastic motion tuned to activity.",
    "Separate ghost vs live trading clusters with differentiated palettes, halos/badges, and state toggles.",
    "Automate snapshot capture of bus-scheduling ghost/live phases and provide timeline playback with scrubbing and export.",
    "Deliver a brain-like layout with camera easing, responsive controls, and polished onboarding/legends.",
    "Verify visuals via scripts/branddozer_ui_capture.py when UI review is required (desktop and mobile)."
  ],
  "scope": {
    "in_scope": [
      "Domain taxonomy mapping to palette assignments, inter-domain edge styling, and legends/filters.",
      "USD-weighted particle system with fiery trails, bounce/elastic motion, and performance budgets.",
      "Ghost vs live visual language, halos/badges, and quick toggles with safe defaults favoring ghost.",
      "Snapshot pipeline for bus-scheduling ghost/live states plus timeline playback with scrubbing and export.",
      "Brain-inspired layout heuristics, camera paths, hover/select tooltips, and responsive UX polish.",
      "UI verification workflow using scripts/branddozer_ui_capture.py and review via codex --image when needed."
    ],
    "out_of_scope": [
      "Changes to core trading logic, bus-scheduling algorithms, or production risk policy.",
      "New data ingestion beyond what is needed for USD valuations and state flags.",
      "VR/AR modes or hardware-specific optimizations beyond standard WebGL targets."
    ]
  ],
  "visual_contract": [
    "Each domain shares a cohesive hue family; inter-domain links use a distinct accent color/weight and are legend-backed.",
    "Ghost vs live clusters are palette-separated with halos/labels; legends and badges reinforce state meaning.",
    "Brain-like organic layout maintains depth cues and low overlap across zoom levels."
  ],
  "data_and_states": [
    "USD valuations (with freshness) drive particle density, size, emission rate, and trail intensity with graceful fallbacks.",
    "Ghost/live trading flags and bus-scheduling phases (pending, scheduled, executing, settled) map to palettes and timeline frames.",
    "Snapshot metadata (timestamp, state counts, domain mix) is stored for playback, export, and audit."
  ],
  "interaction_and_motion": [
    "Fiery trails and bounce/elastic motion scale with USD weight and recent activity; clamps and damping prevent overload.",
    "Timeline playback supports start/stop, loop, speed control, and scrubbing synchronized with camera focus.",
    "Hover/select tooltips, domain/state filters, and deep links to nodes or timestamps aid navigation."
  ],
  "oversight_and_quality": [
    "Color contrast and accessibility checks for palettes, halos, labels, and legends; colorblind-safe alternates offered.",
    "Performance budgets for particle count, shader cost, memory/GPU, and trail intensity with telemetry.",
    "UI verification captures via scripts/branddozer_ui_capture.py (desktop/mobile) when review is required, inspected with codex --image."
  ],
  "workstreams": [
    {
      "name": "Domain Clustering and Palette System",
      "deliverables": [
        "Domain taxonomy and palette mapping with intra- vs inter-domain edge styling and legends.",
        "Filters and isolation controls per domain with responsive layout and depth cues.",
        "Documentation on palette usage and accessibility notes."
      ]
    },
    {
      "name": "USD-Weighted Particle Physics",
      "deliverables": [
        "Normalization from USD value to particle density/size/emission with stale-data fallbacks.",
        "Fiery trail and bounce/elastic motion tuned to value and activity with clamps and controls.",
        "Performance profiling and budgets for particle counts, shaders, and frame rate."
      ]
    },
    {
      "name": "Ghost/Live Separation and Timeline",
      "deliverables": [
        "Ghost vs live palettes, halos/badges, labels, and toggles with safe defaults.",
        "Snapshot capture for bus-scheduling ghost/live phases with retention and health checks.",
        "Timeline playback with scrubbing, loop, speed control, export, and camera sync."
      ]
    },
    {
      "name": "Layout, UX, and Verification",
      "deliverables": [
        "Brain-like layout tuning, camera easing, tooltips, and responsive controls.",
        "Legends, badges, and onboarding cues for colors, trails, and timeline.",
        "Accessibility checks plus UI screenshot suite executed via scripts/branddozer_ui_capture.py."
      ]
    }
  ],
  "milestones": [
    {
      "name": "M1 Visual Contract",
      "exit_criteria": [
        "Approved domain palette and inter-domain edge styling with legends and accessibility notes.",
        "Ghost vs live visual language (palette, halos, labels) accepted by design.",
        "Performance and motion budgets defined for particle counts, trails, and frame rate."
      ]
    },
    {
      "name": "M2 Data Wiring",
      "exit_criteria": [
        "USD valuation feed bound to particle sizing/density with stale fallbacks logged.",
        "Bus-scheduling ghost/live states mapped to visuals and snapshot schema finalized.",
        "Snapshot capture producing timestamped frames with metadata persisted for playback."
      ]
    },
    {
      "name": "M3 Interaction and Playback",
      "exit_criteria": [
        "Timeline playback with scrubbing, loop, speed control, and camera sync across captured frames.",
        "Fiery trail and bounce behaviors tuned and clamped for readability across domains.",
        "Domain and ghost/live filters/toggles validated on desktop and mobile."
      ]
    },
    {
      "name": "M4 QA and Release",
      "exit_criteria": [
        "Accessibility and color contrast checks passed; colorblind-safe palette available.",
        "UI verification screenshots captured (desktop/mobile) via scripts/branddozer_ui_capture.py and reviewed.",
        "Frame rate and load targets met under representative dataset; acceptance from sponsor/product."
      ]
    }
  ],
  "dependencies": [
    "Domain metadata per node to drive clustering and palette assignment.",
    "USD valuation feed per node or edge with freshness indicators.",
    "Ghost/live trading flags and bus-scheduling events with timestamps for snapshots.",
    "WebGL/Three.js (or equivalent) stack with particle, trail, and post-processing support.",
    "Access to scripts/branddozer_ui_capture.py and environments that can run the visualization for capture.",
    "Design guidance for brain-like layout and brand-safe palette choices."
  ],
  "assumptions": [
    "USD valuations and state events arrive with sufficient cadence to animate without large gaps.",
    "Target hardware is a modern laptop/desktop GPU where WebGL particle effects are viable.",
    "Domain taxonomy remains stable enough to keep palettes consistent during delivery.",
    "Brand constraints allow differentiated color sets for domains and ghost/live states."
  ],
  "risks": [
    {
      "risk": "Particle and trail effects degrade performance or clarity at scale.",
      "impact": "Choppy rendering or unreadable clusters; reduced usability.",
      "mitigation": "Set budgets, level-of-detail fallbacks, trail throttling, and motion caps; profile early."
    },
    {
      "risk": "Color systems for domain and ghost/live states create confusion or fail accessibility checks.",
      "impact": "Misinterpretation of state or domain relationships; compliance issues.",
      "mitigation": "Use distinct palettes, halos/shape cues, contrast checks, and colorblind-safe alternatives with legends."
    },
    {
      "risk": "Missing or stale USD valuations distort particle sizing and timelines.",
      "impact": "False emphasis on nodes; misleading playback.",
      "mitigation": "Fallback sizing rules, stale indicators, and logging/alerts for data gaps."
    },
    {
      "risk": "Snapshot pipeline misses bus-scheduling events or desynchronizes from timeline playback.",
      "impact": "Inaccurate playback and oversight gaps.",
      "mitigation": "Event-driven capture with health checks, retention metrics, and reconciliation tests."
    },
    {
      "risk": "Motion tuning (bounce/trails) causes visual noise or discomfort.",
      "impact": "User fatigue and reduced adoption.",
      "mitigation": "Provide animation intensity controls, damping defaults, and quick toggles to simplify motion."
    }
  ],
  "success_metrics": [
    "Reviewers can identify a node's domain and ghost/live state within three seconds in usability checks.",
    "Inter-domain edges remain visually distinct from intra-domain links across all palettes and backgrounds.",
    "Timeline playback covers 100 percent of bus-scheduling state changes over a 24h test window without gaps.",
    "Visualization sustains target frame rate under representative load with particle/trail effects enabled.",
    "UI verification suite (desktop and mobile) via scripts/branddozer_ui_capture.py completes with accepted screenshots."
  ],
  "stakeholders": {
    "sponsor": "TBD",
    "product_owner": "TBD",
    "design": [
      "Visualization/UX lead",
      "Brand and accessibility reviewer"
    ],
    "engineering": [
      "Frontend/WebGL engineer",
      "Backend/telemetry engineer for USD valuations and state feeds"
    ],
    "operations": [
      "Release manager",
      "QA owner for UI verification and snapshot review"
    ],
    "data": [
      "Market data owner for USD valuations",
      "Bus-scheduling state owner"
    ]
  }
}
