{
  "plan_metadata": {
    "name": "Quality Management Plan - Multi-Tier Trading Pipeline Upgrade",
    "version": "0.2",
    "status": "draft",
    "owner": "QA/Risk Lead (TBD)",
    "sponsor": "Product/Risk (TBD)",
    "related_artifacts": [
      "charter_trading_pipeline.json",
      "release_criteria_trading_pipeline.json"
    ]
  },
  "quality_scope": {
    "objectives": [
      "Deliver a tiered strategy stack (fast good-enough, higher-accuracy confirmations, long-horizon) with strict promotion/demotion gates.",
      "Mandate ghost/paper proof of accuracy and slippage control before any live capital; start live with minimal allocation.",
      "Optimize sparse wallet balances across many cryptos/venues and route swaps via bus-style scheduling to maximize spread capture.",
      "Enforce never-lose posture with layered fail-safes, circuit-breakers, and automated kill-switch/rollback paths.",
      "Use proven quant models with modern optimizations that remain CPU-only viable (i5, 32GB).",
      "Provide auditable oversight with structured logs, blotter, and UX/log/screen captures."
    ],
    "in_scope": [
      "Tiered strategy architecture with promotion/demotion logic and capital ladders.",
      "Ghost/backtest/paper harnesses that gate live; minimal-capital live ramps with enforced caps.",
      "Wallet balance optimization for fragmented holdings; venue-aware sizing and fee tiers.",
      "Bus-scheduled swap planner across on/off-ramp legs with fee/time modeling and fallback rails.",
      "Fail-safes: stops hierarchy, circuit-breakers, kill-switch, and rollback automation.",
      "Observability: structured logs, trade blotter, oversight-friendly captures via scripts/branddozer_ui_capture.py.",
      "CPU-only performance optimization for routing, inference, and simulation."
    ],
    "out_of_scope": [
      "Unhedged leverage or derivatives beyond defined risk budgets.",
      "GPU-dependent research; all solutions must remain CPU-viable.",
      "Public-facing consumer UX; focus is trading, routing, and oversight tooling."
    ]
  },
  "quality_principles": [
    "Ghost-first with evidence: live path locked until ghost metrics meet gates; auto-demote on breach.",
    "Capital preservation: hierarchical stops and loss caps; default to hedged or flat on anomalies.",
    "Proven quant factors with modern but reproducible optimizations; deterministic runs with seeded randomness.",
    "Execution edge after fees/slippage/time-in-market is the benchmark; wallet/routing must improve realized edge.",
    "Observability by default: every decision is logged, replayable, and auditable with screens when UI is touched."
  ],
  "roles_and_responsibilities": {
    "qa_risk_lead": "Owns quality gates, sign-off, severity policy, and rollback calls.",
    "quant_lead": "Validates factors/models, approves promotion/demotion criteria per tier.",
    "engineering_lead": "Owns implementation quality, code reviews, deployment hygiene, and config safety.",
    "operations_lead": "Runs drills, monitors health, coordinates on-call, and enforces kill-switch.",
    "compliance_risk": "Reviews policy adherence, capital limits, approved venues/assets, and audit readiness.",
    "data_engineering": "Maintains data quality checks, lineage, and reproducibility of datasets."
  },
  "environments": [
    {
      "name": "local-sim",
      "purpose": "Unit/component tests, deterministic sims, CPU/memory profiling.",
      "data_policy": "Fixtures and sanitized historical data only; no live keys.",
      "exit_criteria": [
        "Lint/type/security checks clean",
        "Unit/component suites pass with seeds fixed for determinism",
        "CPU/RAM within targets on representative runs"
      ]
    },
    {
      "name": "ghost-staging",
      "purpose": "Backtests, paper/ghost runs, bus scheduling simulations, and fail-safe drills.",
      "data_policy": "Paper-mode venues, recorded order books, and sandboxed wallets; secrets disabled.",
      "exit_criteria": [
        "Historical data QA complete (integrity, gaps flagged)",
        "Backtests cover tiers with fee/slippage modeling and spread-aware accounting",
        "Bus/wallet planner meets non-negative expected value in simulation with SLA adherence",
        "Observability coverage at 100 percent for exercised flows"
      ]
    },
    {
      "name": "limited-live",
      "purpose": "Minimal-capital live validation with automated rollbacks and circuit-breakers.",
      "data_policy": "Production credentials with hard caps and enforced kill-switches; approvals recorded.",
      "exit_criteria": [
        "Capital ramps only after two consecutive green windows",
        "No uncontrolled losses or policy violations",
        "MTTR for drills meets target and auto-flatten works"
      ]
    },
    {
      "name": "ramped-live",
      "purpose": "Steady-state production once limited-live is stable.",
      "data_policy": "Production credentials with monitored drift detection and change control.",
      "exit_criteria": [
        "KPIs sustained within bands",
        "Alert SNR healthy with low fatigue",
        "Runbooks validated and on-call trained"
      ]
    }
  ],
  "quality_gates": [
    {
      "gate": "G1 Definition and Controls",
      "entry_criteria": [
        "Requirements and tier definitions stable",
        "Risk budgets and loss-prevention policies drafted"
      ],
      "exit_criteria": [
        "Design review approved with failure-mode checklist (tiers, wallet, bus, kill-switches)",
        "Promotion/demotion rules documented with capital ladders",
        "Performance budget agreed (i5/32GB)"
      ],
      "artifacts": [
        "Design doc and FMEA",
        "Performance budget",
        "Test plan and data sources"
      ]
    },
    {
      "gate": "G2 Implementation and Static Quality",
      "entry_criteria": [
        "Design artifacts signed off",
        "Config toggles for ghost/live and kill-switch wiring implemented"
      ],
      "exit_criteria": [
        "Lint/type/security scans clean; no secrets in repo or logs",
        "Tier logic unit-tested including stop hierarchy and promotion/demotion",
        "Wallet and bus planner components unit-tested with fee/time modeling",
        "CPU/memory smoke profile within budget on sample runs"
      ],
      "artifacts": [
        "Static analysis reports",
        "Unit/component test results",
        "Config diff and toggle map"
      ]
    },
    {
      "gate": "G3 Backtest and Simulation Proof",
      "entry_criteria": [
        "Core algorithms implemented and unit-tested",
        "Data QA complete for backtest windows"
      ],
      "exit_criteria": [
        "Backtests cover tiers with slippage/fee modeling; positive expectation after costs",
        "Wallet/bus planner passes deterministic sim with non-negative expected value and SLA adherence",
        "Circuit-breaker/kill-switch logic verified in simulation",
        "Structured logs and metrics emitted for all flows"
      ],
      "artifacts": [
        "Backtest reports",
        "Simulation logs",
        "Data QA checklist"
      ]
    },
    {
      "gate": "G4 Ghost Trading Proof",
      "entry_criteria": [
        "Backtest targets met",
        "Observability hooks live"
      ],
      "exit_criteria": [
        "Rolling ghost PnL positive for each tier; hit-rate/drawdown targets met",
        "Slippage + fees within budget; spread capture preserved after routing and wallet moves",
        "Circuit-breakers and kill-switch drills succeed; auto-flatten verified",
        "Bus-scheduled swaps and wallet consolidation verified in paper/ghost mode",
        "Ghost-to-live delta model recorded for latency/slippage expectations"
      ],
      "artifacts": [
        "Ghost PnL/hit-rate reports",
        "Drill transcripts",
        "Trade blotter with logs/screens"
      ]
    },
    {
      "gate": "G5 Limited Live Ramp",
      "entry_criteria": [
        "Ghost KPIs green",
        "Ops and risk sign-off on limits"
      ],
      "exit_criteria": [
        "Live started with minimal capital and session loss caps enforced",
        "No uncontrolled losses; auto-flatten works in drills",
        "Promotion/demotion automation proven on live data with rollback paths",
        "Alert routes tested for policy violations, missed hedges, delayed settlements"
      ],
      "artifacts": [
        "Live ramp checklist",
        "Limit approvals",
        "Post-drill logs"
      ]
    },
    {
      "gate": "G6 Steady-State Production",
      "entry_criteria": [
        "Limited live stable across agreed windows"
      ],
      "exit_criteria": [
        "KPIs sustained within bands for consecutive periods",
        "Alert fatigue avoided (alert SNR above target)",
        "Runbooks validated and on-call trained"
      ],
      "artifacts": [
        "KPI dashboard exports",
        "Runbook sign-offs",
        "Incident/post-mortem summaries"
      ]
    }
  ],
  "verification_strategy": {
    "static_and_code_quality": [
      "Linting, type-checking, and security scans on touched modules.",
      "Secrets handling validated; no embedded keys or unsafe logging.",
      "Code review checklist covers fail-safes, capital limits, and CPU budgets."
    ],
    "unit_and_component_tests": [
      "Strategy tiers: entry/exit, promotion/demotion, stop hierarchy, drawdown logic.",
      "Wallet math: balance consolidation, dust handling, fee tiers, min-size checks.",
      "Bus scheduler: route scoring, fee/slippage calculations, fallback rails, settlement timing.",
      "Kill-switch/circuit-breaker triggers and state persistence."
    ],
    "integration_and_system_tests": [
      "End-to-end ghost trade lifecycle from signal -> route -> checkpoint -> PnL attribution.",
      "On/off-ramp bus routes with simulated fees/latency; assert non-negative expected value and SLA adherence.",
      "Multi-venue balance checks with partial fills and retry logic.",
      "Structured logging emitted for every directive and decision; blotter consistency."
    ],
    "simulation_and_backtest": [
      "Out-of-sample and cross-validation on proven quant factors; monitor regime drift.",
      "Spread-aware PnL accounting with fee/slippage stress tests and latency perturbations.",
      "Sensitivity analysis for data gaps and venue outages."
    ],
    "ghost_trading_validation": [
      "Paper/ghost trades with live-like latency profiles; compare fills vs quotes.",
      "Ghost-to-live delta tracked for hit rate, PnL, and slippage budgets.",
      "Auto-rollback tested on missed heartbeats, venue errors, or KPI breaches."
    ],
    "limited_live_validation": [
      "Minimal-capital trades with session/daily caps; verify enforcement and alerts.",
      "Kill-switch path exercises flatten positions within MTTR target.",
      "Promotion scripts locked behind approvals; demotion on first red window."
    ],
    "performance_cpu_only": [
      "Resource profiling under peak routing/inference; CPU <85 percent, RAM <24 GB.",
      "Decision latency targets per tier: T0 <=200ms p95, T1 <=400ms, T2 <=800ms on i5/32GB.",
      "Throughput tests under volatility to avoid latency or slippage budget breaches."
    ],
    "observability_and_ux": [
      "100 percent trade coverage in structured logs, metrics, and blotter exports.",
      "Screenshots/UX captures via scripts/branddozer_ui_capture.py for UI-touched flows and reviewed with codex --image when needed.",
      "Alert routes tested (policy violation, missed hedge, delayed settlement, config drift)."
    ],
    "security_and_compliance": [
      "Secrets pulled from secure vault; no plaintext storage in logs.",
      "Policy checks on allowed venues/assets and chain-specific limits.",
      "Audit artifacts retained with hashes for configs/models/data windows."
    ]
  },
  "metrics_and_targets": {
    "tier_kpis": [
      {
        "metric": "T0 ghost hit rate and PnL",
        "target": ">=52 percent hit rate over 200 ghost trades with positive net PnL after fees"
      },
      {
        "metric": "T1/T2 risk-adjusted return",
        "target": "Sharpe >=0.9 over rolling 14 days ghost; max drawdown <=50 percent of per-tier daily risk budget"
      },
      {
        "metric": "Ghost-to-live discipline",
        "target": "Promotion only after two consecutive green windows; demotion after one red window or policy breach"
      }
    ],
    "execution_and_fees": [
      {
        "metric": "Slippage + fees",
        "target": "<=80 percent of forecast edge and within venue-specific bps budgets"
      },
      {
        "metric": "Bus swap success",
        "target": ">=99 percent swaps complete within SLA with non-negative expected value after fees"
      }
    ],
    "resilience": [
      {
        "metric": "Kill-switch drills",
        "target": "Quarterly minimum; MTTR to flat positions <2 minutes"
      },
      {
        "metric": "Circuit-breaker efficacy",
        "target": "Triggers on data gaps >2 intervals or slippage budget breach; recovers via fallback rails"
      }
    ],
    "performance": [
      {
        "metric": "Resource use",
        "target": "<85 percent CPU and <24 GB RAM on i5/32GB during peak routing/training"
      },
      {
        "metric": "Decision latency",
        "target": "Strategy decision latency within tier targets (T0 <=200ms p95, T1 <=400ms, T2 <=800ms); bus routing <5s in simulation"
      }
    ],
    "observability": [
      {
        "metric": "Coverage",
        "target": "100 percent trades/loggable events produce structured logs and blotter entries; 95 percent screenshot coverage for UI-touched flows"
      },
      {
        "metric": "Heartbeat freshness",
        "target": "Health and data heartbeats <60s lag; alert on two missed intervals"
      }
    ],
    "process": [
      {
        "metric": "Defect escape rate",
        "target": "<5 percent severity-1 defects escaping to limited live per quarter"
      },
      {
        "metric": "Test coverage",
        "target": ">=80 percent coverage on new/changed modules with documented critical scenario coverage"
      }
    ]
  },
  "risk_controls": [
    "Hierarchical stops (per trade, per tier, session) with enforced caps and auto-flatten on breach.",
    "Circuit-breakers on slippage, latency spikes, liquidity thinning, or data gaps; failover to safest rail or ghost-only mode.",
    "Wallet protections: fee-aware consolidation, dust rules, withdrawal/gas thresholds, and settlement timeouts; freeze bus scheduling on SLA breach.",
    "Execution fallbacks and routing to safer rails when preferred venues degrade; prefer hedged exposure over unhedged while in transit.",
    "Promotion/demotion automation with dual approvals for limit changes; default configuration keeps live disabled until gates passed.",
    "Compliance policies on allowed assets/venues and exposure limits; drift detection on configs/models."
  ],
  "data_and_model_governance": {
    "data_quality": [
      "Integrity checks for historical and live feeds (gaps, spikes, stale flags).",
      "Venue fee tables and withdrawal limits versioned; alerts on changes.",
      "Feature pipelines tracked with hashes and window definitions."
    ],
    "model_quality": [
      "Use proven quant factors with modern but reproducible optimizations; document hyperparameters and seeds.",
      "Out-of-sample validation with rolling retrains; monitor regime drift signals.",
      "Model binaries/configs hashed; promotion requires approval and backtest/ghost evidence."
    ],
    "reproducibility": [
      "Deterministic seeds in tests/backtests; artifacts stored with checksums.",
      "Environment manifests captured (python/package versions, config flags)."
    ]
  },
  "defect_and_change_management": {
    "triage": [
      "Severity 0: Uncontrolled loss risk or capital at risk; immediate kill-switch and rollback.",
      "Severity 1: KPI breach, failed guardrail, or policy violation; block promotions until resolved.",
      "Severity 2: Non-blocking defects; schedule into next cycle."
    ],
    "change_control": [
      "Risk rails, capital limits, and promotion logic require dual approval (engineering + risk).",
      "Config changes recorded with hashes; drift detection alerts on mismatches.",
      "Waivers time-bound with explicit owner and expiry."
    ],
    "rollback_and_recovery": [
      "Standard rollback to last known-good bundle; validate via smoke/ghost run.",
      "Auto-flatten trades before config or model rollback.",
      "Post-incident review with action items and owners."
    ]
  },
  "release_and_ramp_plan": {
    "sequence": [
      "Backtest -> Ghost -> Limited Live (minimal capital) -> Ramped Live",
      "Capital increases only after green KPIs and no policy breaches for two consecutive windows.",
      "Automatic demotion to ghost on any Severity 0/1 event or KPI breach."
    ],
    "live_caps": [
      "Initial live allocation <=0.5 percent of available deployable capital per tier.",
      "Per-asset and per-session hard stops; no averaging down without hedge.",
      "Daily loss cap triggers auto-flatten and cooldown."
    ],
    "ramp_rules": [
      "Increase size only after passing G5 checks for consecutive periods with alert SNR healthy.",
      "Freeze ramps on data quality issues, venue instability, or performance regressions."
    ]
  },
  "artifacts_and_tooling": {
    "mandatory_artifacts": [
      "Test reports (unit/integration/backtest/ghost)",
      "Performance profiles and resource usage snapshots",
      "Drill transcripts and rollback proofs",
      "Trade blotter with logs/screens for audited samples"
    ],
    "tooling": [
      "Lint/type/security checks (ruff/mypy or equivalent)",
      "pytest or equivalent for automated tests",
      "Simulation/backtest harness for tiers and bus routing",
      "scripts/branddozer_ui_capture.py for UI verification and screenshots when required"
    ]
  },
  "reporting_and_oversight": {
    "cadence": [
      "Weekly QA/risk status with KPI trends and open defects.",
      "Per-release checklist (gate outcomes, artifacts, approvals).",
      "Monthly audit pack: configs, model hashes, sample trades, drill results."
    ],
    "oversight_artifacts": [
      "Structured logs, trade blotter, PnL curves, and decision traces.",
      "UI/log/screen captures for oversight using scripts/branddozer_ui_capture.py when applicable and reviewed with codex --image when verification is needed.",
      "Runbook links and on-call schedules."
    ]
  }
}
